###############################################
# Utilities
###############################################
cask "raycast"
cask "arc"
cask "vlc"
cask "tunnelblick"
cask "android-file-transfer"
cask "logi-options-plus"
cask "stats"


###############################################
# Development
###############################################

# Core apps
brew "docker"
cask "visual-studio-code"
cask "fork"
cask "warp"
cask "microsoft-remote-desktop"
brew "rbenv"

# Utilities
cask "provisionql"
cask "charles"
cask "http-toolkit"
cask "minisim"
brew "xcodes"
cask "kdiff3"
cask "vnc-viewer"

# React-Native
tap "homebrew/cask-versions"
cask "zulu17"

# Get path to where cask was installed to double-click installer
brew "watchman"
cask "zulu11" # For RN v0.68
cask "android-studio"
cask "react-native-debugger"


###############################################
# Personal
###############################################

cask "spotify"
cask "keepassxc"
cask "whatsapp"
cask "gimp"
cask "discord"
brew "onedrive"
cask "messenger"


###############################################
# VSCode plugins
###############################################

# Background / IDE utilities
vscode "asciidoctor.asciidoctor-vscode"
vscode "EditorConfig.EditorConfig"
vscode "formulahendry.auto-close-tag"
vscode "streetsidesoftware.code-spell-checker"
vscode "naumovs.color-highlight"
vscode "artdiniz.quitcontrol-vscode"
vscode "mechatroner.rainbow-csv"
vscode "ionutvmi.path-autocomplete"

# Frontend development
vscode "nrwl.angular-console"
vscode "YoavBls.pretty-ts-errors"
vscode "codeandstuff.package-json-upgrade"

# Tools
vscode "adpyke.codesnap"
vscode "pomdtr.excalidraw-editor"
vscode "ctcuff.font-preview"
vscode "tomoki1207.pdf"
vscode "jock.svg"
vscode "george-alisson.html-preview-vscode"
vscode "eriklynd.json-tools"
vscode "firsttris.vscode-jest-runner" # running or debugging a specific test or test-suite
vscode "Orta.vscode-jest" # running your current test-suite everytime you change it.

# Copilot
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"

# Git
vscode "mhutchie.git-graph"
vscode "eamodio.gitlens"

# Markdown
vscode "yzhang.markdown-all-in-one"
vscode "bierner.markdown-mermaid"
vscode "TakumiI.markdowntable"
vscode "DavidAnson.vscode-markdownlint"

# Themes
vscode "zhuangtongfa.material-theme"
vscode "PKief.material-icon-theme"
vscode "johnpapa.vscode-peacock"
